# ЗАДАЧА:  Заполните список элементами арифметической прогрессии. Её первый элемент, разность и количество элементов
# нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
# ввод: 7 5 2
# вывод: 7 9 11 13 15

# first_el = int(input('Введите первый элемент: '))
# dif = int(input('Введите разность: '))
# size = int(input('Введите количество элементов: '))
#
# my_list = []
# for i in range(size):
#     my_list.append(first_el + i * dif)
#
# print(my_list)


